#Задача 4: Требуется определить, можно ли от шоколадки размером n × m 
#долек отломить k долек, если разрешается сделать один разлом по прямой между 
#дольками (то есть разломить шоколадку на два прямоугольника).


import os
os.system('CLS')
n= int(input('Введите число n:'))
m= int(input('Введите число m:'))
k= int(input('Введите число k:'))
if(k%n == 0 and k<(n*m)) or (k%m == 0 and k<(m*n)):
    print ('Да, можно')
else:
    print('Нет, нельзя')