#Задача 2: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
#Сколько журавликов сделал каждый ребенок,если известно, что Петя и Сережа сделали одинаковое количество журавликов,
#а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

import os 
os.system('CLS') #очистка экрана

m = int(input('Введите количество сделанных журавликов (число, кратное 6):'))
if m%6  ==  0: #проверка на кратность 6/корректность решения
    print(f"количество журавликов, сделанных Петей равно: {int(m//6)}")
    print(f"количество журавликов, сделанных Сережей равно: {int(m//6)}")
    print(f"количество журавликов, сделанных Катей равно: {int(m*2//3)}")
else:
    print("С данным количеством изделий решение будет некорректным")