#Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
#Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
#Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# import os 
# os.system('CLS') #очистка экрана

# n = int(input('Введите шестизначный номер билета:'))
# n1 = int(n//100000)
# n2 = n%100000//10000
# n3 = n%100000%10000//1000
# n4 = n%100000%10000%1000//100
# n5 = n%100000%10000%1000%100//10
# n6 = n%100000%10000%1000%100%10
# print(f" {n1} {n2} {n3} {n4} {n5} {n6}")
# if (n1+n2+n3)==(n4+n5+n6):
#     print ('Ваш билет счастливый')
# else:
#     print ('Ваш билет обычный, выбросите его в урну')

import os
os.system('CLS') #очистка экрана
n = (input('введите шестизначный номер билета:'))
a = int(n[0])+int(n[1])+int(n[2])
b = int(n[3])+int(n[4])+int(n[5])
print(f" {n[0]} {n[1]} {n[2]} {n[3]} {n[4]} {n[5]}")
if a == b:
  print('Ваш билет счастливый')
else:
  print('Ваш билет обычный, выбросите его в урну')